# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, SwinTransformerYoloLayer, [0, 128, 1280, 4]],  # 0-P1/2
    [-1, 1, SwinTransformerYoloLayer, [1]], # 1-P2/2
    [-1, 1, SwinTransformerYoloLayer, [2]], # 2-P3/2
    [-1, 1, SwinTransformerYoloLayer, [3]], # 3-P4/2
  ]


# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [[-1, 2], 1, CrossAttentionV2, [512, 16, 32]],  # 5 -> cat backbone P4
   [-1, 3, C3, [512, False]],  # 6

   [-1, 1, Conv, [256, 1, 1]],
   [[-1, 1], 1, CrossAttentionV2, [256, 8, 16]],  # 8 -> cat backbone P3
   [-1, 3, C3, [256, False]],  # 9

   [-1, 1, Conv, [512, 1, 1]],
   [[-1, 6], 1, CrossAttentionV2, [512, 16, 8]],  # 11 -> cat head P4
   [-1, 3, C3, [512, False]],  # 12

   [-1, 1, Conv, [1024, 1, 1]],
   [[-1, 3], 1, CrossAttentionV2, [1024, 32, 16]],  # 14 -> cat head P5
   [-1, 3, C3, [1024, False]],  # 15

   [[9, 12, 15], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
