# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [[-1, 6], 1, CrossAttentionV2, [512, 16, 32]],  # 11 -> cat backbone P4
   [-1, 1, CBAM, [512]],  # 12
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [[-1, 4], 1, CrossAttentionV2, [256, 8, 16]],  # 15 -> cat backbone P3
   [-1, 1, CBAM, [256]],  # 16
   [-1, 3, C3, [256, False]],  # 17

   [-1, 1, Conv, [512, 1, 1]],
   [[-1, 13], 1, CrossAttentionV2, [512, 16, 8]],  # 19 -> cat head P4
   [-1, 1, CBAM, [512]],  # 20
   [-1, 3, C3, [512, False]],  # 21

   [-1, 1, Conv, [1024, 1, 1]],
   [[-1, 9], 1, CrossAttentionV2, [1024, 32, 16]],  # 23 -> cat head P5
   [-1, 1, CBAM, [1024]],  # 24
   [-1, 3, C3, [1024, False]],  # 25

   [[17, 21, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
